Tekla Open API Reference for Tekla Structures 2025
StraightDimensionAttributes Methods
The StraightDimension.StraightDimensionAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 The attributes can't be loaded.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
StraightDimension.StraightDimensionAttributes Class
Tekla.Structures.Drawing Namespace